tap "kdash-rs/kdash"
brew "argocd"
brew "atuin"
brew "awscli"
brew "bat"
brew "bottom"
brew "dua-cli"
brew "exiftool"
brew "eza"
brew "fd"
brew "fnm"
brew "fx"
brew "fzf"
brew "gdu"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitui"
brew "glow"
brew "go"
brew "helm"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "litecli"
brew "micro"
brew "pgcli"
brew "protobuf"
brew "rainfrog"
brew "ripgrep"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "superfile"
brew "tlrc"
brew "uv"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "kdash-rs/kdash/kdash"
cask "1password"
cask "1password-cli"
cask "arc"
cask "balenaetcher"
cask "brave-browser"
cask "claude-code"
cask "cloudflare-warp"
cask "codex"
cask "firefox"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "horos"
cask "keepingyouawake"
cask "keka"
cask "linearmouse"
cask "localsend"
cask "maccy"
cask "middleclick"
cask "obsidian"
cask "rectangle"
cask "thaw"
cask "visual-studio-code"
cask "zed"
cask "zen"
vscode "aaron-bond.better-comments"
vscode "alefragnani.bookmarks"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "edgardmessias.clipboard-manager"
vscode "foxundermoon.shell-format"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "mathematic.vscode-pdf"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.symbols"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "quicktype.quicktype"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "yzhang.markdown-all-in-one"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/pressly/goose/v3/cmd/goose"
go "github.com/haya14busa/goplay/cmd/goplay"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "go.uber.org/mock/mockgen"
go "github.com/oapi-codegen/oapi-codegen/v2/cmd/oapi-codegen"
go "github.com/swaggo/swag/v2/cmd/swag"
uv "ruff"
