brew "argocd"
brew "atuin"
brew "awscli"
brew "bat"
brew "btop"
brew "buf"
brew "dust"
brew "exiftool"
brew "eza"
brew "fd"
brew "fnm"
brew "fx"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "go"
brew "helm"
brew "htop"
brew "jq"
brew "k9s"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "libpq"
brew "litecli"
brew "micro"
brew "mongosh"
brew "ncdu"
brew "opentofu"
brew "pgcli"
brew "pyright"
brew "ripgrep"
brew "ruff"
brew "sevenzip"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "superfile"
brew "tlrc"
brew "typescript"
brew "typescript-language-server"
brew "uv"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "1password"
cask "1password-cli"
cask "balenaetcher"
cask "betterdisplay"
cask "brave-browser"
cask "claude-code"
cask "cloudflare-warp"
cask "codex"
cask "firefox"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "horos"
cask "iina"
cask "keepingyouawake"
cask "keka"
cask "linearmouse"
cask "localsend"
cask "maccy"
cask "middleclick"
cask "obsidian"
cask "rectangle"
cask "telegram"
cask "vscodium"
cask "whatsapp"
cask "zed"
vscode "alefragnani.bookmarks"
vscode "bufbuild.vscode-buf"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "detachhead.basedpyright"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "jeanp413.open-remote-ssh"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-python-envs"
vscode "opentofu.vscode-opentofu"
vscode "pkief.material-icon-theme"
vscode "pkief.material-product-icons"
vscode "redhat.vscode-yaml"
vscode "tombi-toml.tombi"
vscode "usernamehw.errorlens"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/pressly/goose/v3/cmd/goose"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "github.com/josharian/impl"
go "go.uber.org/mock/mockgen"
go "github.com/swaggo/swag/v2/cmd/swag"
